**************************  INFINITE CYCLES  **************************
* It is possible to recursively call macro from itself.
* The number of calls is limited in HLASM:
         MACRO
         MAC
         MAC
         MEND 

         MAC
