         MACRO
         TEST
         TEST1
         TEST2
         MEND

         TEST
         TEST1
         TEST2

         MNOTE 'DONE'

         END